[
  {
    "nomImage": "chemins_bus.jpg",
    "nom": "chemins_bus",
    "titre": "Itineraires de bus",
    "description": "Codage de méthodes du plus court chemin en python appliqué sur le réseau de bus du bab",
    "date": "Projet en semestre 2 de BUT 1 en Mathématiques",
    "type": [0, 1]
  },
  {
    "nomImage": "SurfNow.png",
    "nom": "surfNow",
    "titre": "SurfNow",
    "description": "Application maquetée puis programmée en html et css",
    "date": "Projet en semestre 1 de BUT 1 en Développement web",
    "type": [1]
  },
  {
    "nomImage": "bataille_navale.jpg",
    "nom": "bataille",
    "titre": "Bataille navale",
    "description": "Interface du jeux de la Bataille codé sur la console en C++",
    "date": "Projet en semestre 1 de BUT 1 en Programmation bas niveau",
    "type": [0, 1]
  },
  {
    "nomImage": "roulette.jpg",
    "nom": "roulette",
    "titre": "Jeux de la roulette",
    "description": "Programme C++ qui affiche dans la console le jeux de la roulette et qui permet de tenter automatiquement des méthodes sur de grands nombres de parties pour observer la tendance. On peut y jouer en naviguant avec les fleches puis en validant avec entrer. L'affichage est dynamique en fonction de ce que le joueur séléctionne.",
    "date": "Projet personnel réalisé en semestre 2 de BUT 1",
    "type": [0, 1]
  },
  {
    "nomImage": "puissance4.jpg",
    "nom": "puissance4",
    "titre": "Puissance 4",
    "description": "Codage du puissance 4 en assembleur sur simulateur à la suite d'une évaluation reprenant un bout de l'algorithme (affichage des jetons)",
    "date": "Projet personnel de fin de BUT1",
    "type": [0]
  },
  {
    "nomImage": "reseau.jpg",
    "nom": "reseau",
    "titre": "Adressage réseau d'une entreprise",
    "description": "Architecture réseau d'une entreprise factice pensée et adressée depuis Marionnet",
    "date": "Projet en semestre 2 de BUT 1 en Réseau",
    "type": [2]
  },
  {
    "nomImage": "bruitage.jpg",
    "nom": "bruitage",
    "titre": "Bruitage d'image",
    "description": "Programme python qui va bruiter une image plus ou moins .Il peut également transformer un pixel art avec beaucoup de pixels en un pixel art avec le strice minimum de pixels.",
    "type": [0]
  },
  {
    "nomImage": "Hanoi.jpg",
    "nom": "hanoi",
    "titre": "Tours d'Hanoï",
    "description": "Programme C++ qui permet de jouer aux tours d'Hanoï dans la console. Il suffit de cliquer sur la tour de base puis sa destination. On peut également retourner en arrière grace à un système de pile.",
    "date": "Projet personnel basé sur un TP en semestre 2 de BUT 1 en programmation bas niveau",
    "type": [0, 1]
  },
  {
    "nomImage": "demineur.jpg",
    "nom": "demineur",
    "titre": "Démineur",
    "description": "Programme C++ qui permet de jouer au démineur dans la console. Il suffit d'écrire l'instruction puis de valider et la console se met a jour.",
    "date": "Projet personnel au semestre 1 du BUT 1",
    "type": [0, 1]
  },
  {
    "nomImage": "graphique_python.jpg",
    "nom": "graphiques_rugby",
    "titre": "Analyses équipe rugby",
    "description": "Programme python affichant des graphiques divers et variés liés à différentes analyses sur des données csv d'une équipe de rugby.",
    "date": "Projet en semestre 2 de BUT 1 en mathématiques",
    "type": [0]
  },
  {
    "nomImage": "Chifoumi.jpg",
    "nom": "chifoumi",
    "titre": "Chifoumi",
    "description": "Programme C++ utilisant un modèle MVP sur QT. Ce chifoumi est très complet : persalisation du temps et du pseudo, pause du temps, identification avec une base de donnée et bien plus encore.",
    "date": "Projet en semestre 2 de BUT 1 en programmation IHM",
    "type": [0, 1]
  }
]
